/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_issmall.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yootaki <yootaki@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/05 11:43:16 by yootaki           #+#    #+#             */
/*   Updated: 2021/10/05 11:43:17 by yootaki          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "mylibft.h"

/* aとbを比較して小さい方の数字を返す */
int	ft_issmall(int a, int b)
{
	if (a < b)
		return (a);
	else if (a > b)
		return (b);
	else
		return (a);
}
